Autodesk.Revit.DB.ExternalResourceUIBrowseResultType
Describes the type of external resource browsing result.
Remarks:
This enum is used to describe the type of external resources browsing operation result ( the browsing operation
include list folders and resources of an external server or a folder, or open an external resource in browsing dialog.)
The meaning of each enum value:
There is no predefined error happened during this browse operation. The DB server can store any errors itself in this case.  FolderNotFound means the external resource folder want to browse could not be founded in external server. ResourceNotFound means the external resource want to open could not be founded in external server.
Since:
2015
Describes the type of external resource browsing result.
Since:
2015

Autodesk.Revit.DB.ExternalResourceUIBrowseResultType.ResourceNotFound
The specified external resource cannot be found by external resource server.

Autodesk.Revit.DB.ExternalResourceUIBrowseResultType.FolderNotFound
The specified external resource folder cannot be found by external resource server.

Autodesk.Revit.DB.ExternalResourceUIBrowseResultType.Success
There is no predefined error happened during this browse operation. The DB server can store any errors itself in this case.